<?php
return [
    "pterodactyl" => [
        
        "offline" => "вимкнено",
        "online" => "Зійди",
        "failed" => [
            "alreadycreated"    => "Не вдалося створити сервер, оскільки він уже створений",
            "changepkgexist"    => "Не вдалося змінити пакет сервера, оскільки він не існує",
            "suspendexist"      => "Не вдалося призупинити сервер, оскільки він не існує.",
            "unsuspendexist"    => "Не вдалося скасувати призупинення сервера, оскільки він не існує.",
            "terminateexist"    => "Не вдалося видалити сервер, оскільки він не існує.",
            "satisfying"        => "Не вдалося знайти вузли, які задовольняють запит",
            "pwdempty"          => "Пароль не повинен бути порожнім",
            "linkserver"        => "Не вдалося змінити пароль, оскільки зв’язаний сервер не існує",
            "retrieveuser"      => "Помилка відновлення користувача, отримано код помилки : %status_code%",
            "changepwd"         => "Не вдалося змінити пароль, отримано код помилки : %status_code%",
            "createuser"        => "Не вдалося створити користувача, отримано код помилки : %status_code%",
            "geteggs"           => "Не вдалося отримати дані про яйця, отримано код помилки : %status_code%",
            "getserver"         => "Не вдалося отримати дані із сервера, отримано код помилки : %status_code%",
            "createserver"      => "Не вдалося створити сервер, отримано код помилки : %status_code%",
            "suspendserver"     => "Помилка призупинення сервера, отримано код помилки : %status_code%",
            "unsuspendserver"   => "Не вдалося розблокувати сервер, отримано код помилки : %status_code%",
            "terminateserver"   => "Не вдалося видалити сервер, отримано код помилки : %status_code%",
            "buildserver"       => "Не вдалося оновити версію сервера, отримано код помилки : %status_code%",
            "startupserver"     => "Не вдалося оновити завантаження сервера, отримано код помилки : %status_code%"
        ],
        "panel" => [
            "disk" => "Місце на диску",
            "memory" => "Пам'ять",
            "button" => "Керувати моїм сервером",
            
            "problem" => "У вас проблеми з хостингом?",
            "openticket" => "Відкрийте квиток!", 
            "information" => "Інформація про проживання",
            
            "start" => "Щоб запустити",
            "stop" => "Вимкнути",
            "powerstop" => "Вбити",
            "restart" => "Щоб перезапустити",
        ],
        "adminindex" => [
            "title" => "Установка птеродактиля",
            "subtitle" => "Керуйте конфігураціями своїх пропозицій.",
            "memory"    => "Пам'ять",
            "disk"      => "Місце на диску",
            "productname"=> "Назва продукту",
        ],
        "config" => [
            "title" => "Налаштування сервера",
            "subtitle" => "Керуйте різними характеристиками пропозиції.",
        ],
        "form" => [
            "resources" => [
                "title"     => "Ресурси",
                "memory"    => "Пам'ять (МБ)",
                "disk"      => "Місце на диску (МБ)",
                "swap"      => "обмінюватися",
                "io"        => "Блок IO",
                "portrange" => "Порт для призначення серверу (приклад: 3000-4000)",
                "cpu"       => "Ліміт ЦП (%)",
            ],
            "features" => [
                "title" => "Особливості",
                "databases" => "Бази даних для призначення серверу",
                "backups"   => "Резервні копії даних, які призначаються серверу",
            ],
            "core" => [
                "title" => "Інформація",
                "servername"=> "Ім'я сервера",
                "egg" => "ID Яйце птеродактиля",
                "nest" => "ID гніздовий птеродактиль",
                "location" => "ID Прокат Птеродактиля"
            ],
            "configurations" => [
                "title" => "Конфігурація",
                "image" => "Образ Docker",
                "startup" => "Команда запуску",
                "oomkiller" => "Вимкніть OOM Killer",
                "dedicatedip" => "Виділена IP-адреса",
            ]
        ]
    ]
];
